# coding=utf8
import jieba
import re


def remove(text):
    remove_chars = '[0-9’!"#$%&\'()*+,-./:;<=>?@，。?★、…【】《》？“”‘’！[\\]^_`{|}~]+'
    return re.sub(remove_chars, '', text)


# seg_list = jieba.cut("我来到北京清华大学", cut_all=True, HMM=False)
# print("Full Mode: " + "/ ".join(seg_list))  # 全模式
t = "后皇嘉树，橘徕服兮。受命不迁，生南国兮。深固难徙，更壹志兮。绿叶素荣，纷其可喜兮。曾枝剡棘，圆果抟兮。青黄杂糅，文章烂兮。精色内白，类任道兮。纷缊宜脩，姱而不丑兮。嗟尔幼志，有以异兮。独立不迁，岂不可喜兮。深固难徙，廓其无求兮。苏世独立，横而不流兮。闭心自慎，终不失过兮。秉德无私，参天地兮。愿岁并谢，与长友兮。淑离不淫，梗其有理兮。年岁虽少，可师长兮。行比伯夷，置以为像兮。"

### 《山鬼》、《湘夫人》、《渔父》、《国殇》、《橘颂》文本
text1 = "若有人兮山之阿，被薜荔兮带女萝;既含睇兮又宜笑，子慕予兮善窈窕;乘赤豹兮从文狸，辛夷车兮结桂旗;被石兰兮带杜衡，折芳馨兮遗所思;余处幽篁兮终不见天，路险难兮独后来;表独立兮山之上，云容容兮而在下;杳冥冥兮羌昼晦，东风飘兮神灵雨;留灵修兮憺忘归，岁既晏兮孰华予;采三秀兮于山间，石磊磊兮葛蔓蔓怨公子兮怅忘归，君思我兮不得闲;山中人兮芳杜若，饮石泉兮荫松柏;君思我兮然疑作;雷填填兮雨冥冥，猿啾啾兮狖夜鸣;风飒飒兮木萧萧，思公子兮徒离忧。"
text2 = "帝子降兮北渚，目眇眇兮愁予。袅袅兮秋风，洞庭波兮木叶下。登白薠兮骋望，与佳期兮夕张。鸟何萃兮蘋中?罾何为兮木上?沅有茝兮醴有兰，思公子兮未敢言。荒忽兮远望，观流水兮潺湲。麋何食兮庭中?蛟何为兮水裔?朝驰余马兮江皋，夕济兮西澨。闻佳人兮召予，将腾驾兮偕逝。筑室兮水中，葺之兮荷盖。荪壁兮紫坛，插芳椒兮盈堂。桂栋兮兰橑，辛夷楣兮药房。罔薜荔兮为帷，擗蕙櫋兮既张。白玉兮为镇，疏石兰兮为芳。芷葺兮荷屋，缭之兮杜衡。合百草兮实庭，建芳馨兮庑门。九嶷缤兮并迎，灵之来兮如云。捐余袂兮江中，遗余褋兮醴浦。搴汀洲兮杜若，将以遗兮远者。时不可兮骤得，聊逍遥兮容与。"
text3 = "屈原既放，游于江潭，行吟泽畔，颜色憔悴，形容枯槁。渔父见而问之曰“子非三闾大夫与？何故至于斯？”屈原曰“举世皆浊我独清，众人皆醉我独醒，是以见放。”渔父曰“圣人不凝滞于物，而能与世推移。世人皆浊，何不淈其泥而扬其波？众人皆醉，何不哺其糟而歠其醨？何故深思高举，自令放为？”屈原曰“吾闻之，新沐者必弹冠，新浴者必振衣安能以身之察察，受物之汶汶者乎？宁赴湘流，葬于江鱼之腹中。安能以皓皓之白，而蒙世俗之尘埃乎?”渔父莞尔而笑，鼓枻而去。乃歌曰“沧浪之水清兮，可以濯吾缨沧浪之水浊兮，可以濯吾足。”遂去，不复与言。"
text4 = "操吴戈兮披犀甲，车错毂兮短兵接。旌蔽日兮敌若云，矢交坠兮士争先。凌余阵兮躐余行，左骖殪兮右刃伤。霾两轮兮絷四马，援玉枹兮击鸣鼓。天时怼兮威灵怒，严杀尽兮弃原野。出不入兮往不反，平原忽兮路超远。带长剑兮挟秦弓，首身离兮心不惩。诚既勇兮又以武，终刚强兮不可凌。身既死兮神以灵，魂魄毅兮为鬼雄。"
text5 = "后皇嘉树，橘徕服兮。受命不迁，生南国兮。深固难徙，更壹志兮。绿叶素荣，纷其可喜兮。曾枝剡棘，圆果抟兮。青黄杂糅，文章烂兮。精色内白，类任道兮。纷缊宜脩，姱而不丑兮。嗟尔幼志，有以异兮。独立不迁，岂不可喜兮。深固难徙，廓其无求兮。苏世独立，横而不流兮。闭心自慎，终不失过兮。秉德无私，参天地兮。愿岁并谢，与长友兮。淑离不淫，梗其有理兮。年岁虽少，可师长兮。行比伯夷，置以为像兮。"
# text3 = re.sub(r'〔\d+〕', '', t)
# text3 = re.sub(r'\d+', '', t)
# print(text3)

s1 = remove(text1)
s2 = remove(text2)
s3 = remove(text3)
s4 = remove(text4)
s5 = remove(text5)

quyuan = []
for i in s1:
    quyuan.append(i)
for i in s2:
    quyuan.append(i)
for i in s3:
    quyuan.append(i)
for i in s4:
    quyuan.append(i)
for i in s5:
    quyuan.append(i)
print(quyuan)



